[
    {
      "id": 4,
      "title": "Painting has begun on playoff picture",
      "date": "2022-11-17",
      "content": "Anisha and Maya, my beautiful sister and my sister, have become the first team to clinch playoff berth and the first team to be mathematically eliminated from the playoffs, respectively. Anisha came into this season an underdog, never having reached the playoffs before despite being a member of the league since its inauguration 2018. With a 9-1 record, Like Jesus at Red Rocks won 6 straight games before being taken down by 4 Hr Independent Study in her only loss to date. Anisha's team has been led to greatness mainly by her two quarterbacks, Jalen Hurts and Justin Fields, the QB3 and QB4 of the season so far. Maya, another league veteran, also entered the season with low expectations. Though officially a co-manager with Jackson, Maya took on more of a solo role this year. Unluckily, her first round draft pick Najee Harris ended up being a bust, and her top scoring player is Daniel Jones, currently the QB16. In the draft recap, it was noted that Maya's reluctance to draft a QB early could be a weakness and it seems that those predictions have come true. As the youngest manager in the league, Maya is still maturing and may yet become a force to be reckoned with in future seasons. "
    },
    {
      "id": 3,
      "title": "Dak Spotted!",
      "date": "2022-10-13",
      "content": "On Wednesday, Dak went out to play in the yard for the first time since injuring his right paw in Week 1. He was seen favoring his uninjured left paw during some \"light fetching\", though he did not practice with the team.  After speaking to reporters that told him that his receivers said his passes had some pop on them, he replied \"I always got some pop on my balls. I'm not going to throw if I ain't got pop on my balls. WOOF!\" Dak, of course, does not have balls, so this quote does raise some questions about his mental state but at least he is in high spirits. Dak said he felt \"great\" after his fetching session, but coach Mike McCarthy made it clear that Dak is only in the rehab phase. \"We have to trust the medical process,\" McCarthy said, \"and that process involves playing Cooper Rush right now because he is better. Dak needs to rest a lot so that we can keep winning.\" The NFL Canine Players Association did not have any comment."
    },
    {
      "id": 2,
      "title": "Yahoo! found not responsible for manager failures",
      "date": "2022-09-30",
      "content": "After an extensive internal review, the Yahoo! Fantasy platform was found not responsible for Maya and Jackson's poor performance as co-managers throughout the life of this league. The duo have consistently finished in the bottom third, their best finish being 8th place in 2019, a year which saw the league padded with several Killing Eve fans who had never heard of football. Maya alleges that it's the Yahoo! platform that has kept her from performing to her fullest potential. \"The fact is that there is simply no mechanic on the platform that would affect Maya any differently than the other managers,\" said Cory Took, head of the investigative committee. \"Furthermore, no specific complaint about the platform has been lodged by Maya or anyone else.\" A separate committee has been formed to evaluate new platforms for a potential 2023 switch, but the commissioner made it clear that those plans were in the works prior to Maya's filing. \"We are not in the business of making sweeping changes based on the complaints of a single manager, no matter how annoying they may be,\" said the commisioner in an official statement. No reparations will be given to Maya at this time."
    },
    {
      "id": 1,
      "title": "Shocking trade shakes league",
      "date": "2022-09-08",
      "content": "Though the controversial trade between Allen Work and No Play and Rowan’s Terrific Team had its detractors, there were ultimately not enough vetoes to prevent it from going through. On Sunday, Beyonce’s birthday of all days, Rowan gave up her number one draft pick Dalvin Cook for the 17th drafted quarterback Tua Tagovailoa, in what one manager called “a highway robbery” and another called “a huge blow for feminism.” There’s no doubt that Rowan needed a starting QB badly, though with several teams carrying an extra QB that they probably would have given up for a price, one wonders whether Rowan spent enough time in negotiations. It’s also unfortunate for everyone else that Allen’s gamble of using his first two rounds on QBs is not looking like much of a gamble anymore since he now also has an elite RB to add to his lineup. Allen’s manager Brian is currently in delinquent status for failing to pay the 2021 entry fee."
    }
  ]